using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Файтинг
{
    internal class AboutCharacters
    {
        static public List<string> aboutCharacters = new List<string>() { "Жестче, чем любой мужчина, и боец по натуре, Байкен пожертвовала всем ради достижения одной цели." +
            " Она всегда готова к оружию, и спор быстро превращается в драку, если в нем участвует Байкен. Она часто действует, не подумав, но придерживается своих принципов и предпочитает" +
            " все выкладывать начистоту. Хотя она предпочитает драться, чем говорить, она способна признать свою неправоту, если аргументы достаточно сильны.",

            "После рождения Гиры быстро взрослеют, что может привести к некоторой путанице, когда их видимый возраст не соответствует их реальному" +
            " возрасту. Даже их хронологический возраст не сравним с человеческим, поскольку их превосходная способность" +
            " поглощать и обрабатывать информацию означает, что к трем годам Гир по сути равен взрослому человеку.",

            "Лидер пиратов (Медузы). Он является мастером стиля Хирофуми в фехтовании. Он очень широко известен в мире, где он живет, и его репутация" +
            " бабника опережает его. Он спасает детей, осиротевших после войны (только женщин), и берет их на борт своего корабля. Он разбойник мирового" +
            " класса, но живет под мантрой (Помогай слабым и растягивай сильных), что сделало его популярным в массах.",

            "Потомок племени, которое было загнано в угол и вымерло от рук Правосудия. Он - настройщик, способный видеть и управлять потоками" +
            " энергии во всех вещах под солнцем. Этой способностью обладают лишь несколько избранных членов семьи Кум, что делает его чрезвычайно" +
            " ценным для всего мира.",

            "Потеряв всю семью во время крестовых походов, Мэй скиталась по полям сражений, пока ее не подобрал Джонни, плутоватый капитан пиратов (Медузы)." +
            " С тех пор как она присоединилась к их команде, она стала одним из самых важных членов и любит своих товарищей, как родных.",

            "Формы жизни, известные как Валентинки, рождаются на заднем дворе и не испытывают эмоций. Они не понимают таких понятий, как" +
            " правильно, неправильно, нравится, не нравится или ценность - кроме желания завершить свои миссии. Таким образом, приказы от сущности, которую" +
            " они называют Матерью, являются абсолютными.  "
        };

        static public List<string> Names = new List<string>() { "Baiken", "Dizzy", "Johny", "Kum Haehyum", "May", "Ramlethal" };
    }
}
